Конфигурация/AccumulationRegisters/РезервыПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыПИФ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/РезервыПИФ/Ext/ManagerModule.bsl
Функция ПолучитьТекстЗапросаДляКонтроляКоличестваРегистраторов() Экспорт

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&Регистратор КАК Регистратор,
		|	НаборЗаписей.ВидДвижения КАК ВидДвижения,
		|	НАЧАЛОПЕРИОДА(НаборЗаписей.Период, ДЕНЬ) КАК ПериодНачало,
		|	КОНЕЦПЕРИОДА(НаборЗаписей.Период, ДЕНЬ) КАК ПериодКонец,
		|	НаборЗаписей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НаборЗаписей.Организация КАК Организация,
		|	НаборЗаписей.Резерв КАК Резерв
		|ПОМЕСТИТЬ _НаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|ГДЕ
		|	НаборЗаписей.Резерв В (ЗНАЧЕНИЕ(Справочник.Резервы.ВознаграждениеДепозитарияАудитораОценщика), ЗНАЧЕНИЕ(Справочник.Резервы.ВознаграждениеУправляющего), ЗНАЧЕНИЕ(Справочник.Резервы.ПрочиеВозмещаемыеРасходыУправляющего))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РезервыПИФ.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.РезервыПИФ КАК РезервыПИФ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НаборЗаписей КАК _НаборЗаписей
		|		ПО (РезервыПИФ.Период МЕЖДУ _НаборЗаписей.ПериодНачало И _НаборЗаписей.ПериодКонец)
		|			И РезервыПИФ.Организация = _НаборЗаписей.Организация
		|			И РезервыПИФ.СчетДоверительногоУправления = _НаборЗаписей.СчетДоверительногоУправления
		|			И РезервыПИФ.Резерв = _НаборЗаписей.Резерв
		|			И РезервыПИФ.ВидДвижения = _НаборЗаписей.ВидДвижения
		|ГДЕ
		|	РезервыПИФ.Активность
		|	И РезервыПИФ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И РезервыПИФ.Регистратор <> _НаборЗаписей.Регистратор";
	
	Возврат ТекстЗапроса

КонецФункции
